"An error occurred. Please try again." = "Une erreur s'est produite. Veuillez réessayer.";

"Card brand was not updated. Please try again." = "La marque de la carte n'a pas été mise à jour. Veuillez réessayer.";

"Close" = "Fermer";

"Default payment method was not updated. Please try again." = "Le mode de paiement par défaut n'a pas été mis à jour. Veuillez réessayer.";

"Scan Card" = "Scanner la carte";

"Scan card" = "Scanner la carte";

"The IBAN you entered is invalid." = "L'IBAN que vous avez saisi n'est pas valide.";

"There was an error processing your card -- try again in a few seconds" = "Une erreur est survenue lors du traitement de votre carte. Réessayez dans quelques secondes.";

"There was an unexpected error -- try again in a few seconds" = "Une erreur inattendue est survenue. Réessayez dans quelques secondes.";

"Try again" = "Réessayer";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Nous faisons appel à Stripe pour vérifier les informations de votre carte. Stripe peut utiliser et stocker vos données conformément à sa politique de confidentialité. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>En savoir plus</u></a>";

"Your card has expired" = "Votre carte a expiré";

"Your card was declined" = "Votre carte a été refusée";

"Your card's expiration month is invalid" = "Le mois d'expiration de votre carte n'est pas valide";

"Your card's expiration year is invalid" = "L'année d'expiration de votre carte n'est pas valide";

"Your card's number is invalid" = "Votre numéro de carte n'est pas valide";

"Your card's security code is invalid" = "Le code de sécurité de votre carte n'est pas valide";

"Your name is invalid." = "Votre nom n'est pas valide.";

"Your payment method was declined." = "Votre moyen de paiement a été refusé.";
